In [2]:
import tensorflow as tf
import pathlib
import os
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [4]:
file_path = tf.keras.utils.get_file('shakespeare.txt', 'https://storage.googleapis.com/download.tensorflow.org/data/shakespeare.txt')

In [5]:
dataset = tf.data.TextLineDataset(file_path)

In [9]:
for line in dataset.take(10):
  print(line.numpy())

b'First Citizen:'
b'Before we proceed any further, hear me speak.'
b''
b'All:'
b'Speak, speak.'
b''
b'First Citizen:'
b'You are all resolved rather to die than to famish?'
b''
b'All:'

In [ ]:
# Titanic Dataset

In [12]:
file_path = tf.keras.utils.get_file("train.csv", "https://storage.googleapis.com/tf-datasets/titanic/train.csv")
dataset = tf.data.TextLineDataset(file_path)

In [13]:
for line in dataset.take(10):
  print(line.numpy())

b'survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone'
b'0,male,22.0,1,0,7.25,Third,unknown,Southampton,n'
b'1,female,38.0,1,0,71.2833,First,C,Cherbourg,n'
b'1,female,26.0,0,0,7.925,Third,unknown,Southampton,y'
b'1,female,35.0,1,0,53.1,First,C,Southampton,n'
b'0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y'
b'0,male,2.0,3,1,21.075,Third,unknown,Southampton,n'
b'1,female,27.0,0,2,11.1333,Third,unknown,Southampton,n'
b'1,female,14.0,1,0,30.0708,Second,unknown,Cherbourg,n'
b'1,female,4.0,1,1,16.7,Third,G,Southampton,n'

In [23]:
def survived(line):
  return tf.not_equal(tf.strings.substr(line, 0,1), "0")

survived = dataset.skip(0).filter(survived)

In [24]:
for line in survived.take(10):
  print(line.numpy())

b'survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone'
b'1,female,38.0,1,0,71.2833,First,C,Cherbourg,n'
b'1,female,26.0,0,0,7.925,Third,unknown,Southampton,y'
b'1,female,35.0,1,0,53.1,First,C,Southampton,n'
b'1,female,27.0,0,2,11.1333,Third,unknown,Southampton,n'
b'1,female,14.0,1,0,30.0708,Second,unknown,Cherbourg,n'
b'1,female,4.0,1,1,16.7,Third,G,Southampton,n'
b'1,male,28.0,0,0,13.0,Second,unknown,Southampton,y'
b'1,female,28.0,0,0,7.225,Third,unknown,Cherbourg,y'
b'1,male,28.0,0,0,35.5,First,A,Southampton,y'

In [26]:
df = pd.read_csv(file_path)
df.head(5)

   survived     sex   age  ...     deck  embark_town  alone
0         0    male  22.0  ...  unknown  Southampton      n
1         1  female  38.0  ...        C    Cherbourg      n
2         1  female  26.0  ...  unknown  Southampton      y
3         1  female  35.0  ...        C  Southampton      n
4         0    male  28.0  ...  unknown   Queenstown      y

[5 rows x 10 columns]

In [29]:
data_batches = tf.data.experimental.make_csv_dataset(
    file_path, batch_size=5,
    label_name="survived", select_columns=['sex', 'age', 'survived'])

In [35]:
for i,j in data_batches.take(2):
  print("'survived': {}".format(j))
  for key, value in i.items():
    print("{}    : {}".format(key, value))

'survived': [0 1 0 1 0]
sex    : [b'male' b'female' b'male' b'female' b'male']
age    : [49. 28. 32. 19. 27.]
'survived': [0 1 0 0 0]
sex    : [b'male' b'female' b'male' b'male' b'male']
age    : [20. 24. 16. 28. 36.]